// ปิดการทำงานของ console ทั้งหมด
console.log = function() {};
console.warn = function() {};
console.error = function() {};
console.info = function() {};

// ใช้ URL ของ Google Apps Script
const SCRIPT_URL = "https://script.google.com/macros/s/AKfycbzP-HCQGbA3Xi2Ms4DXTGy8k17Bv72pFohnJ0txAePjjXybe6pK42mSaYOfTQ5V9Q6mDA/exec";

// Global State
let allRequestsCache = [];
let allMemosCache = [];
let userMemosCache = [];
let allUsersCache = [];
window.requestsChartInstance = null;
window.statusChartInstance = null;
let currentPublicWeeklyData = []; // เพิ่มตัวแปร global สำหรับ public weekly

let specialPositionMap = {
    'รองผู้อำนวยการกลุ่มบริหารทั่วไป':'นางวชิรินทรา พัฒนกุลเดช',
    'รองผู้อำนวยการกลุ่มบริหารงานบุคคล':'นางปณิชา ภัสสิรากุล',
    'รองผู้อำนวยการกลุ่มบริหารงบประมาณ':'นางจันทิมา นกอยู่',
    'รองผู้อำนวยการกลุ่มบริหารวิชาการ': 'นายมงคล เกตมณี',
    'หัวหน้ากลุ่มบริหารทั่วไป':'นายสุชาติ สินทร',
    'หัวหน้ากลุ่มบริหารงานบุคคล':'นายพงษ์ศักดิ์ ทองโพธิกุล',
    'หัวหน้ากลุ่มบริหารงบประมาณ':'นางสาวนุชนาฎ อำพันเสน',
    'หัวหน้ากลุ่มบริหารวิชาการ':'นางสาวสาวิทตรี อุ่นทองศิริ',
    'หัวหน้ากลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี': 'นางสาวปิยราช พันธุ์กมลศิลป์',
    'รองหัวหน้ากลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี':'นายอำนาจ ทัศนา',
    'หัวหน้ากลุ่มสาระการเรียนรู้คณิตศาสตร์': 'นายสมฤทธิ์ ชาญสมร',
    'หัวหน้ากลุ่มสาระการเรียนรู้ภาษาไทย': 'นายอานนท์ วรวงค์',
    'หัวหน้ากลุ่มสาระการเรียนรู้ภาษาต่างประเทศ': 'นางธรรมรักษ์ วัฒนพลาชัยกูร',
    'หัวหน้ากลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนา และวัฒนธรรม': 'นางเกศริน ทองโพธิกุล',
    'หัวหน้ากลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา': 'นางสาวเกษร เขจรลาภ',
    'หัวหน้ากลุ่มสาระการเรียนรู้ศิลปะ': 'นางสาวปิยลักษณ์ ขันทา',
    'หัวหน้ากลุ่มสาระการเรียนรู้การงานอาชีพ': 'นายสุชาติ สินทร',
    'หัวหน้างานแนะแนว':'นายเริงศักดิ์ จันทร์นวล',
    '.....................................':'.....................................'
};

const statusTranslations = {
    'Pending': 'กำลังดำเนินการ',
    'Submitted': 'รอการตรวจสอบ',
    'Approved': 'เสร็จสิ้น',
    'Pending Approval': 'รอการตรวจสอบ',
    'เสร็จสิ้น/รับไฟล์ไปใช้งาน': 'เสร็จสิ้น',
    'เสร็จสิ้น': 'เสร็จสิ้น',
    'รอเอกสาร (เบิก)': 'รอเอกสาร (เบิก)',
    'นำกลับไปแก้ไข': 'นำกลับไปแก้ไข',
    'เสร็จสิ้นรอออกคำสั่งไปราชการ': 'เสร็จสิ้นรอออกคำสั่ง',
    'รอตรวจสอบและออกคำสั่งไปราชการ': 'รอตรวจสอบและออกคำสั่ง',
    'กำลังดำเนินการ': 'กำลังดำเนินการ'
};

function translateStatus(status) {
    return statusTranslations[status] || status;
}